nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1182/mcuxpresso/startup_mimxrt1182.cpp
WEAK void DMA3_CH6_IRQHandler(void)
{   DMA3_CH6_DriverIRQHandler();
}

WEAK void DMA3_CH7_IRQHandler(void)
{   DMA3_CH7_DriverIRQHandler();
}

WEAK void DMA3_CH8_IRQHandler(void)
{   DMA3_CH8_DriverIRQHandler();
}

WEAK void DMA3_CH9_IRQHandler(void)
{   DMA3_CH9_DriverIRQHandler();
}

WEAK void DMA3_CH10_IRQHandler(void)
{   DMA3_CH10_DriverIRQHandler();
}

WEAK void DMA3_CH11_IRQHandler(void)
{   DMA3_CH11_DriverIRQHandler();
}

WEAK void DMA3_CH12_IRQHandler(void)
{   DMA3_CH12_DriverIRQHandler();
}

WEAK void DMA3_CH13_IRQHandler(void)
{   DMA3_CH13_DriverIRQHandler();
}

WEAK void DMA3_CH14_IRQHandler(void)
{   DMA3_CH14_DriverIRQHandler();
}

WEAK void DMA3_CH15_IRQHandler(void)
{   DMA3_CH15_DriverIRQHandler();
}

WEAK void DMA3_CH16_IRQHandler(void)
{   DMA3_CH16_DriverIRQHandler();
}

WEAK void DMA3_CH17_IRQHandler(void)
{   DMA3_CH17_DriverIRQHandler();
}

WEAK void DMA3_CH18_IRQHandler(void)
{   DMA3_CH18_DriverIRQHandler();
}

WEAK void DMA3_CH19_IRQHandler(void)
{   DMA3_CH19_DriverIRQHandler();
}

WEAK void DMA3_CH20_IRQHandler(void)
{   DMA3_CH20_DriverIRQHandler();
}

WEAK void DMA3_CH21_IRQHandler(void)
{   DMA3_CH21_DriverIRQHandler();
}

WEAK void DMA3_CH22_IRQHandler(void)
{   DMA3_CH22_DriverIRQHandler();
}

WEAK void DMA3_CH23_IRQHandler(void)
{   DMA3_CH23_DriverIRQHandler();
}

WEAK void DMA3_CH24_IRQHandler(void)
{   DMA3_CH24_DriverIRQHandler();
}

WEAK void DMA3_CH25_IRQHandler(void)
{   DMA3_CH25_DriverIRQHandler();
}

WEAK void DMA3_CH26_IRQHandler(void)
{   DMA3_CH26_DriverIRQHandler();
}

WEAK void DMA3_CH27_IRQHandler(void)
{   DMA3_CH27_DriverIRQHandler();
}

WEAK void DMA3_CH28_IRQHandler(void)
{   DMA3_CH28_DriverIRQHandler();
}

WEAK void DMA3_CH29_IRQHandler(void)
{   DMA3_CH29_DriverIRQHandler();
}

WEAK void DMA3_CH30_IRQHandler(void)
{   DMA3_CH30_DriverIRQHandler();
}

WEAK void DMA3_CH31_IRQHandler(void)
{   DMA3_CH31_DriverIRQHandler();
}

WEAK void DMA4_ERROR_IRQHandler(void)
{   DMA4_ERROR_DriverIRQHandler();
}

WEAK void DMA4_CH0_CH1_CH32_CH33_IRQHandler(void)
{   DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler();
}

WEAK void DMA4_CH2_CH3_CH34_CH35_IRQHandler(void)
{   DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler();
}

WEAK void DMA4_CH4_CH5_CH36_CH37_IRQHandler(void)
{   DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler();
}

WEAK void DMA4_CH6_CH7_CH38_CH39_IRQHandler(void)
{   DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler();
}

WEAK void DMA4_CH8_CH9_CH40_CH41_IRQHandler(void)
{   DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler();
}

WEAK void DMA4_CH10_CH11_CH42_CH43_IRQHandler(void)
{   DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler();
}

WEAK void DMA4_CH12_CH13_CH44_CH45_IRQHandler(void)
{   DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler();
}

WEAK void DMA4_CH14_CH15_CH46_CH47_IRQHandler(void)
{   DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler();
}

WEAK void DMA4_CH16_CH17_CH48_CH49_IRQHandler(void)
{   DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler();
}

WEAK void DMA4_CH18_CH19_CH50_CH51_IRQHandler(void)
{   DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler();
}

WEAK void DMA4_CH20_CH21_CH52_CH53_IRQHandler(void)
{   DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler();
}

WEAK void DMA4_CH22_CH23_CH54_CH55_IRQHandler(void)
{   DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler();
}

WEAK void DMA4_CH24_CH25_CH56_CH57_IRQHandler(void)
{   DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler();
}

WEAK void DMA4_CH26_CH27_CH58_CH59_IRQHandler(void)
{   DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler();
}

WEAK void DMA4_CH28_CH29_CH60_CH61_IRQHandler(void)
{   DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler();
}

WEAK void DMA4_CH30_CH31_CH62_CH63_IRQHandler(void)
{   DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler();
}

WEAK void XBAR1_CH0_CH1_IRQHandler(void)
{   XBAR1_CH0_CH1_DriverIRQHandler();
}

WEAK void XBAR1_CH2_CH3_IRQHandler(void)
{   XBAR1_CH2_CH3_DriverIRQHandler();
}

WEAK void Reserved162_IRQHandler(void)
{   Reserved162_DriverIRQHandler();
}

WEAK void EWM_IRQHandler(void)
{   EWM_DriverIRQHandler();
}

WEAK void Reserved164_IRQHandler(void)
{   Reserved164_DriverIRQHandler();
}

WEAK void LPIT3_IRQHandler(void)
{   LPIT3_DriverIRQHandler();
}

WEAK void Reserved166_IRQHandler(void)
{   Reserved166_DriverIRQHandler();
}

WEAK void TMR4_IRQHandler(void)
{   TMR4_DriverIRQHandler();
}

WEAK void Reserved168_IRQHandler(void)
{   Reserved168_DriverIRQHandler();
}

WEAK void Reserved169_IRQHandler(void)
{   Reserved169_DriverIRQHandler();
}

WEAK void SAI4_IRQHandler(void)
{   SAI4_DriverIRQHandler();
}

WEAK void SPDIF_IRQHandler(void)
{   SPDIF_DriverIRQHandler();
}

WEAK void Reserved172_IRQHandler(void)
{   Reserved172_DriverIRQHandler();
}

WEAK void Reserved173_IRQHandler(void)
{   Reserved173_DriverIRQHandler();
}

WEAK void Reserved174_IRQHandler(void)
{   Reserved174_DriverIRQHandler();
}

WEAK void Reserved175_IRQHandler(void)
{   Reserved175_DriverIRQHandler();
}

WEAK void INTG_BOOTROM_DEBUG_CTRL_IRQHandler(void)
{   INTG_BOOTROM_DEBUG_CTRL_DriverIRQHandler();
}

WEAK void EDGELOCK_REQ1_IRQHandler(void)
{   EDGELOCK_REQ1_DriverIRQHandler();
}

WEAK void EDGELOCK_REQ2_IRQHandler(void)
{   EDGELOCK_REQ2_DriverIRQHandler();
}

WEAK void EDGELOCK_REQ3_IRQHandler(void)
{   EDGELOCK_REQ3_DriverIRQHandler();
}

WEAK void TMR3_IRQHandler(void)
{   TMR3_DriverIRQHandler();
}

WEAK void JTAGC_IRQHandler(void)
{   JTAGC_DriverIRQHandler();
}

WEAK void M33_SYSRESET_REQ_IRQHandler(void)
{   M33_SYSRESET_REQ_DriverIRQHandler();
}

WEAK void M33_LOCKUP_IRQHandler(void)
{   M33_LOCKUP_DriverIRQHandler();
}

WEAK void M7_SYSRESET_REQ_IRQHandler(void)
{   M7_SYSRESET_REQ_DriverIRQHandler();
}

WEAK void M7_LOCKUP_IRQHandler(void)
{   M7_LOCKUP_DriverIRQHandler();
}

WEAK void PWM2_FAULT_IRQHandler(void)
{   PWM2_FAULT_DriverIRQHandler();
}

WEAK void PWM2_0_IRQHandler(void)
{   PWM2_0_DriverIRQHandler();
}

WEAK void PWM2_1_IRQHandler(void)
{   PWM2_1_DriverIRQHandler();
}

WEAK void PWM2_2_IRQHandler(void)
{   PWM2_2_DriverIRQHandler();
}

WEAK void PWM2_3_IRQHandler(void)
{   PWM2_3_DriverIRQHandler();
}

WEAK void Reserved191_IRQHandler(void)
{   Reserved191_DriverIRQHandler();
}

WEAK void Reserved192_IRQHandler(void)
{   Reserved192_DriverIRQHandler();
}

WEAK void Reserved193_IRQHandler(void)
{   Reserved193_DriverIRQHandler();
}

WEAK void Reserved194_IRQHandler(void)
{   Reserved194_DriverIRQHandler();
}

WEAK void Reserved195_IRQHandler(void)
{   Reserved195_DriverIRQHandler();
}

WEAK void Reserved196_IRQHandler(void)
{   Reserved196_DriverIRQHandler();
}

